[
  {
    "title": "Health Supplement Store",
    "button_label": "Versagora",
    "description": "Tasked with emulating the successful design of a market leader, I developed an intuitive and detail-focused online store for a new health supplement brand.\nTarget Audience:\nHealth-conscious individuals who are looking for quality supplements to enhance their well-being.\nExecution:\nMy role involved customizing and creating Shopify sections with a keen eye on design details to match the client’s vision. Regular reviews on various devices ensured the store’s responsiveness and user experience adhered to the high standards set by the theme author.",
    "images": [
      {
        "url": "/versagora/01_desktop_hero_versagora.jpg",
        "alt": "Hero section showcasing a stack of balanced stones on a beach with text promoting energy-boosting supplements."
      },
      {
        "url": "/versagora/02_desktop_versagora.jpg",
        "alt": "Bestselling products section featuring Multivitamin Gummies, Mushroom Extract Complex, and Ashwagandha supplements."
      },
      {
        "url": "/versagora/03_desktop_versagora.jpg",
        "alt": "Section highlighting athletic performance supplements with a female tennis player and a sliced orange filled with vitamins and supplements."
      },
      {
        "url": "/versagora/04_desktop_versagora.jpg",
        "alt": "Ashwagandha supplement product page displaying product details, pricing, and health benefits."
      },
      {
        "url": "/versagora/05_desktop_versagora.jpg",
        "alt": "Suggested use and ingredients section for Ashwagandha supplement, featuring product information and potential health benefits."
      },
      {
        "url": "/versagora/06_mobiili_versagora.jpg",
        "alt": "Mobile version of the website showcasing various sections, including the hero banner, bestsellers, and Ashwagandha product page."
      }
    ]
  },
  {
    "title": "Store Creation with Real-Time Stock Sync",
    "button_label": "Housumaailma",
    "description": "I developed and customized a Shopify store for a women's trousers brand. The store features a unique solution to sync stock quantities with the manufacturer's inventory, updating four times daily. This ensures accurate, real-time stock levels for customers. My role included creating the store, implementing the stock update solution, and tailoring the site to meet the client's needs.",
    "images": [
      {
        "url": "/housumaailma/housumaailma-desktop-1.png",
        "alt": "A homepage of an online store named 'Housumaailma,' featuring two women modeling pants on either side of the logo. The navigation bar includes categories such as 'Koti,' 'Housut,' 'Hameet,' and more. The website highlights a clean, minimalist design with neutral colors and a focus on fashion."
      },
      {
        "url": "/housumaailma/housumaailma-desktop-2.png",
        "alt": "A product page for 'Taylor Regular Capri Medium Length - Navy' priced at €99. A woman is modeling the pants, standing confidently with her arms crossed. The page includes size selection, quantity control, and buttons for adding to the shopping cart or purchasing immediately."
      },
      {
        "url": "/housumaailma/housumaailma-desktop-2.png",
        "alt": "A product listing page showing various capri pants, including styles like 'Elizabeth Slim Capri Medium Length' and 'Kelly Regular Capri Short Length,' in different colors such as black, blue denim, and navy. Each product includes the price and model wearing the pants."
      },
      {
        "url": "/housumaailma/housumaailma-mobile-1.png",
        "alt": "Mobile views of the Housumaailma website, showcasing a fashion model in a black shirt on the homepage, the 'Taylor Regular Capri' product page, and a capri pants collection page. The mobile version mirrors the clean, minimalist design and highlights product options with large images and simple navigation."
      }
    ]
  },
  {
    "title": "Butique for tall women",
    "button_label": "whitneyallysyn.com",
    "description": "Shopify E-commerce creation from scratch, close cooperation with the merchant. Creating high converting E-commerce shops while following closely the merchant design and feature request. We both like to think we have created a beautiful, high-converting site.",
    "images": [
      {
        "url": "/whitney/jt_desktop_whitney1.jpg",
        "alt": "Fashion model in beige coat adjusting sunglasses, overlayed text reading 'Bring your brand to life' with an optional button for hero video."
      },
      {
        "url": "/whitney/jt_desktop_whitney2.jpg",
        "alt": "Lifestyle section featuring a woman in a green sweater, large video with a text box showcasing custom orders."
      },
      {
        "url": "/whitney/jt_desktop_whitney3.jpg",
        "alt": "Blog posts section featuring three thumbnails: group of women, cityscape view, and a drink, with text below each thumbnail."
      },
      {
        "url": "/whitney/jt_desktop_whitney4.jpg",
        "alt": "Limited-time promotion featuring a woman in a white dress, with a product grid of fashion items below."
      },
      {
        "url": "/whitney/jt_desktop_whitney5.jpg",
        "alt": "Product detail page for 'Fall/Winter Capsule Jumpsuit,' showing product image, color and size options, and an add-to-cart button."
      },
      {
        "url": "/whitney/jt_mobiili_whitney1.jpg",
        "alt": "Mobile view of the Whitney Allysyn homepage featuring a hero image of a woman in a beige coat, with overlay text promoting hero videos."
      }
    ]
  },
  {
    "title": "Children's fashion store",
    "button_label": "mamaswildchild.com.au",
    "description": "On this children's fashion store, I customized Shopify's premium theme Prestige and implemented a hidden password-protected wholesales section, with wholesale prices.",
    "images": [
      {
        "url": "/mamaswildchild/jt_desktop_mamaswildchild1.jpg",
        "alt": "Website screenshot for Mama's Wild Child. Two children wearing illustrated t-shirts featuring Australian wilderness themes, standing by the ocean. The website promotes kids' clothing inspired by Australian flora and fauna, with original watercolor art prints and accompanying book series about Australia's wild places."
      },
      
      {
        "url": "/mamaswildchild/jt_desktop_mamaswildchild2.jpg",
        "alt": "Website section showing categories for Tee's & Rompers, Wildling Books, and Activities & Resources with images of children in nature-themed clothing and a 'View the Range' button below."
      },
      {
        "url": "/mamaswildchild/jt_desktop_mamaswildchild3.jpg",
        "alt": "Product page featuring a child wearing a two-tone t-shirt with an anglerfish illustration and the text 'Wild One.' The product description highlights original artwork, biodegradable cotton, available sizes 1 to 10 years, and options to add to cart or buy now."
      },
      {
        "url": "/mamaswildchild/jt_mobiili_mamaswildchild1.jpg",
        "alt": "Mobile view of Mama's Wild Child website showing three different pages: the homepage with kids' clothing inspired by Australian wilderness, a category page for tees and rompers, and a product page for a 'Wild One' anglerfish t-shirt. Each page highlights nature-themed apparel and book offerings, with options to view and purchase items."
      }
    ]
  },
  {
    "title": "eCommerce store migration to Shopify",
    "button_label": "pellavakauppa.fi",
    "description": " Project:\nMigrating an eCommerce Platform from a Small Local Platform to Shopify\nObjective:\nThe objective of this project was to migrate an eCommerce platform from a local platform to Shopify\nScope:\nThe project scope included transferring all products, customers, orders, and other relevant data from the current platform to Shopify. The migrated store was required to have the same functionalities and features as the existing platform, including payment gateways, shipping options, and customer accounts.\nDeliverables:\nA fully migrated and functional eCommerce store on the Shopify platform.",
    "images": [
      {
        "url": "/mimi/jt_desktop_mimi1.jpg",
        "alt": "Website screenshot for Mimi.fi, a Finnish clothing store featuring natural material garments. The page displays models wearing striped dresses from the Pont Neuf collection. Navigation includes categories like tunics, jackets, ponchos, and linen art pieces. Store information and opening hours for the physical location in Turku are also provided."
      },
      {
        "url": "/mimi/jt_desktop_mimi2.jpg",
        "alt": "Product listing page on Mimi.fi featuring tunics, sweaters, and tops in various colors. Each garment is made from natural materials, with prices ranging from €179 to €189. Models wear red, white, grey, and plum-colored tunics, showcasing comfortable and stylish designs."
      },
      {
        "url": "/mimi/jt_desktop_mimi3.jpg",
        "alt": "Product page on Mimi.fi for the grey 'Sonja' linen tunic priced at €189. The tunic is available in sizes XS to 3XL. Options to select size, quantity, and add to cart are displayed, along with local pickup information and a description of the tunic's soft, comfortable design."
      },
      {
        "url": "/mimi/jt_mobiili_mimi1.jpg",
        "alt": "Mobile view of the Mimi.fi website showing three different pages: the homepage with store information and featured products, a category page with a black poncho listed at €99, and a product page for the grey 'Sonja' linen tunic priced at €189. The pages highlight natural material clothing options with descriptions, price, and options to add to cart."
      }
    ]
  },
  {
    "title": "",
    "button_label": "",
    "description": "",
    "images": [
      {
        "url": "",
        "alt": ""
      }
    ]
  }
]