[
  {
    "title": "Store Creation with Real-Time Stock Sync",
    "button_label": "Housumaailma",
    "description": "I created and customized a Shopify store for a women’s trousers brand. A bespoke script syncs inventory with the manufacturer four times daily. Shoppers always see exact stock levels, avoiding disappointment. The streamlined design keeps focus on fit and style.",
    "images": [
      {
        "url": "/housumaailma/housumaailma-desktop-1.webp",
        "alt": "Desktop homepage of Housumaailma showing two women modeling trousers beside the logo with a minimalist navigation bar"
      },
      {
        "url": "/housumaailma/housumaailma-desktop-2.webp",
        "alt": "Desktop product page for navy Taylor Regular Capri showing model, size selector, quantity control, and buy buttons"
      },
      {
        "url": "/housumaailma/housumaailma-desktop-2.webp",
        "alt": "Desktop listing of capri pants styles with model thumbnails, prices, and style names like Elizabeth and Kelly"
      },
      {
        "url": "/housumaailma/housumaailma-mobile-1.webp",
        "alt": "Mobile view of Housumaailma showing homepage model, Taylor Regular Capri page, and capri collection with simple nav"
      }
    ],
    "url": "https://www.housumaailma.fi/",
    "active": true
  },
  {
    "title": "Elysia Cosmetics Shopify Store",
    "button_label": "Elysia Cosmetics",
    "description": "I built Elysia Cosmetics’ Shopify store, tailoring a premium theme with HTML, CSS, JS, and Liquid. Dynamic variants and metafield‑driven content keep every product detail precise and on‑brand. A video hero, refined UX, and built‑in affiliate links elevate engagement and sales. Post‑launch fixes and polish delivered a turnkey site the client enthusiastically endorses.",
    "images": [
      {
        "url": "/elysia/elysia-desktop-1.webp",
        "alt": "Desktop hero slider showing an athletic woman doing a pull‑up under the Elysia logo and “Unstoppable Beauty” headline"
      },
      {
        "url": "/elysia/elysia-desktop-2.webp",
        "alt": "Desktop listing of three Elysia product cards—Combo, Liquid Foundation, Liquid Corrector—with offer tags, prices, and ratings"
      },
      {
        "url": "/elysia/elysia-desktop-3.webp",
        "alt": "Desktop product page for Liquid Foundation showing large product image, color swatches, price, quantity selector, and Add to Cart/Buy Now buttons"
      },
      {
        "url": "/elysia/elysia-mobile-1.webp",
        "alt": "Mobile view: Elysia hero image, a product card for the Combo with price and rating, and the Liquid Foundation detail page with swatches and buy button"
      }
    ],
    "url": "https://elysiacosmetics.com",
    "active": true
  },
  {
    "title": "Boutique for tall women",
    "button_label": "whitneyallysyn.com",
    "description": "I partnered closely with the founder to launch a boutique for tall women on Shopify. Pixel‑perfect theme tweaks and rich‑media storytelling showcase each collection. Smooth funnels lead shoppers from lookbook to cart. The result is a stylish, high‑converting flagship site.",
    "images": [
      {
        "url": "/whitney/jt_desktop_whitney1.webp",
        "alt": "Fashion model in beige coat adjusting sunglasses, overlayed text reading 'Bring your brand to life' with an optional button for hero video."
      },
      {
        "url": "/whitney/jt_desktop_whitney2.webp",
        "alt": "Lifestyle section featuring a woman in a green sweater, large video with a text box showcasing custom orders."
      },
      {
        "url": "/whitney/jt_desktop_whitney3.webp",
        "alt": "Blog posts section featuring three thumbnails: group of women, cityscape view, and a drink, with text below each thumbnail."
      },
      {
        "url": "/whitney/jt_desktop_whitney4.webp",
        "alt": "Limited-time promotion featuring a woman in a white dress, with a product grid of fashion items below."
      },
      {
        "url": "/whitney/jt_desktop_whitney5.webp",
        "alt": "Product detail page for 'Fall/Winter Capsule Jumpsuit,' showing product image, color and size options, and an add-to-cart button."
      },
      {
        "url": "/whitney/jt_mobiili_whitney1.webp",
        "alt": "Mobile view of the Whitney Allysyn homepage featuring a hero image of a woman in a beige coat, with overlay text promoting hero videos."
      }
    ],
    "url": "https://www.whitneyallysyn.com/",
    "active": true
  },
  {
    "title": "Children's fashion store",
    "button_label": "mamaswildchild.com.au",
    "description": "I customized premium theme for a kids’ fashion label inspired by Australian wildlife. A hidden, password‑protected wholesale area offers tiered pricing to retailers. Parents enjoy playful shopping while stockists order in bulk seamlessly. The build balances charm with robust B2B features.",
    "images": [
      {
        "url": "/mamaswildchild/jt_desktop_mamaswildchild1.webp",
        "alt": "Desktop view: two children by the ocean wearing illustrated wilderness‑themed t‑shirts on Mama’s Wild Child homepage"
      },      
      {
        "url": "/mamaswildchild/jt_desktop_mamaswildchild2.webp",
        "alt": "Desktop section: categories for Tees & Rompers, Wildling Books, and Activities with images and “View the Range” button"
      },
      {
        "url": "/mamaswildchild/jt_desktop_mamaswildchild3.webp",
        "alt": "Desktop product page: child modeling a two-tone anglerfish “Wild One” t‑shirt with size selector and add‑to‑cart option"
      },
      {
        "url": "/mamaswildchild/jt_mobiili_mamaswildchild1.webp",
        "alt": "Mobile view: Mama’s Wild Child showing homepage, tees & rompers category, and Wild One anglerfish t‑shirt product page with simple navigation"
      }
    ],
    "url": "https://mamaswildchild.com.au/",
    "active": true
  },
  {
    "title": "eCommerce store migration to Shopify",
    "button_label": "pellavakauppa.fi",
    "description": "I migrated an entire catalogue from a local platform to Shopify without downtime. Products, customers, orders, and settings were transferred and verified. Payment, shipping, and accounts work exactly as before—only faster. The Shopify stack now supports growth with apps and easier management.",
    "images": [
      {
        "url": "/mimi/jt_desktop_mimi1.webp",
        "alt": "Desktop homepage: Mimi.fi model wearing striped Pont Neuf dresses, navigation for tunics, jackets, ponchos, plus store info and hours"
      },
      {
        "url": "/mimi/jt_desktop_mimi2.webp",
        "alt": "Desktop listing: Mimi.fi display of tunics, sweaters, and tops with model thumbnails and prices (€179–€189)"
      },
      {
        "url": "/mimi/jt_desktop_mimi3.webp",
        "alt": "Desktop product page: grey Sonja linen tunic (€189) with size XS–3XL selector, add‑to‑cart button, and local pickup details"
      },
      {
        "url": "/mimi/jt_mobiili_mimi1.webp",
        "alt": "Mobile view: Mimi.fi homepage, category page showing black poncho (€99), and product page for grey Sonja tunic"
      }
    ],
    "url": "https://pellavakauppa.fi/",
    "active": true
  },
  {
    "title": "Health Supplement Store",
    "button_label": "Versagora",
    "description": "I built a clean, conversion‑focused health‑supplement store, matching a market leader’s aesthetic. Custom Shopify sections were designed and fine‑tuned across devices. The site guides health‑conscious shoppers quickly to key products. Precise styling builds trust and drives repeat orders.",
    "images": [
      {
        "url": "/versagora/01_desktop_hero_versagora.webp",
        "alt": "Hero section showcasing a stack of balanced stones on a beach with text promoting energy-boosting supplements."
      },
      {
        "url": "/versagora/02_desktop_versagora.webp",
        "alt": "Bestselling products section featuring Multivitamin Gummies, Mushroom Extract Complex, and Ashwagandha supplements."
      },
      {
        "url": "/versagora/03_desktop_versagora.webp",
        "alt": "Section highlighting athletic performance supplements with a female tennis player and a sliced orange filled with vitamins and supplements."
      },
      {
        "url": "/versagora/04_desktop_versagora.webp",
        "alt": "Ashwagandha supplement product page displaying product details, pricing, and health benefits."
      },
      {
        "url": "/versagora/05_desktop_versagora.webp",
        "alt": "Suggested use and ingredients section for Ashwagandha supplement, featuring product information and potential health benefits."
      },
      {
        "url": "/versagora/06_mobiili_versagora.webp",
        "alt": "Mobile version of the website showcasing various sections, including the hero banner, bestsellers, and Ashwagandha product page."
      }
    ],
    "active": false
  },
  {
    "title": "",
    "button_label": "",
    "description": "",
    "images": [
      {
        "url": "",
        "alt": ""
      }
    ],
    "active": true
  }
]